route_project/app/controllers/artworks_controller.rb

  def index
    if params[:user_id]
      artworks = Artwork.where(artist_id: params[:user_id])
      shares = ArtworkShare.where(viewer_id: params[:user_id])
      all = artworks + shares.map { |share| share.artwork }
      render json: all
    else
      render json: Artwork.all
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 13]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 11]]
SELECT "artworks".* FROM "artworks"

  def update
    artwork = Artwork.find(params[:id])
    artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "My amazing masterpiece"], ["updated_at", "2018-11-12 23:28:42.662911"], ["id", 6]]