route_project/app/controllers/comments_controller.rb

  def index
    if params[:user_id]
      comments = Comment.where(user_id: params[:user_id])
      render json: comments
    elsif params[:artwork_id]
      comments = Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 17]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 8]]