route_project/app/controllers/users_controller.rb

  def index

    if request.query_string.present?
      users = User.all
      params.each do |key, v|
        next if key == "controller" || key == "action"
        v = v.split(',')
        users = User.where("#{key}": v)
      end
      render json: users
    else
      users = User.all
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."key" = $1  [["key", "13"]]

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "emma"], ["updated_at", "2018-11-12 22:33:34.784128"], ["id", 3]]