route_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 13]]
---
  def show
    user = User.find(params[:id])